using UnityEngine;

public class EntryPoint : MonoBehaviour
{
    /* Тоже не успел но тут ничего сложного изначально пустая сцена для быстрого старта игры перекидает на игровую сцену окно загрузки 
     подгружаем все системки (Initialized) и отключаем панель загрузки сделал бы все в Courutine все ентри поинт готов :) 
    
     Если есть ошыбки сори давно не писал по Русски обычн на укр или англ
    
     А и ещо я бы запёк свет что бы небыло проблем с ним при переходе между сценами гарного дня
     */
}
